
/* Task 1 */

/** Создать объект, описывающий прямоугольник (хранит коор-
динаты левой верхней и правой нижней точек), и написать следу-
ющие функции для работы с таким объектом.
1. Функция принимает объект-прямоугольник и выводит
информацию о нем (где какая точка расположена).
2. Функция принимает объект-прямоугольник и возвращает
его ширину.
3. Функция принимает объект-прямоугольник и возвращает
его высоту.
4. Функция принимает объект-прямоугольник и возвращает
его площадь.
5. Функция принимает объект-прямоугольник и возвращает
его периметр.
6. Функция изменения ширины прямоугольника. Она прини-
мает объект-прямоугольник и на сколько единиц изменить
ширину.
7. Функция изменения высоты прямоугольника. Она прини-
мает объект-прямоугольник и на сколько единиц изменить
высоту.
8. Функция изменения ширины и высоты прямоугольника.
Она принимает объект-прямоугольник и два значения –
для изменения ширины и высоты.
9. Функция смещения прямоугольника по оси X. Она при-
нимает объект-прямоугольник и на сколько единиц его
сдвинуть.
10. Функция смещения прямоугольника по оси Y. Она при-
нимает объект-прямоугольник и на сколько единиц его
сдвинуть.
11. Функция смещения прямоугольника и по оси X и по
оси Y. Она принимает объект-прямоугольник и два значе-
ния: сдвиг по оси X и сдвиг по оси Y.
12. Функция для проверки, находится ли точка внутри пря-
моугольника. Она принимает объект-прямоугольник и
координаты точки. */